Tekla.Structures.ModelInternal.RebarSetAction
Defines a set of actions that may be performed on the cre side with rebar sets.

Tekla.Structures.ModelInternal.RebarSetAction.BeginCreate
Begin the create function - just clears out cache.

Tekla.Structures.ModelInternal.RebarSetAction.EndCreate
Ends the create function - does the insert.

Tekla.Structures.ModelInternal.RebarSetAction.BeginModify
Begin the modify function - just clears out cache.

Tekla.Structures.ModelInternal.RebarSetAction.EndModify
Ends the modify function - does the update.

Tekla.Structures.ModelInternal.RebarSetAction.BeginSelect
Begin the select function - gets the face indexes etc.

Tekla.Structures.ModelInternal.RebarSetAction.EndSelect
End the select function - just clears out cache.